app/controllers/registration_controller.rb

	def create
    if request.referer.to_s.downcase.include? "vinny"
      campaign = request.referer.split('.com/').last
    else
      campaign = "other"
    end
    @user = User.create(:ip => request.remote_ip, :campaign => campaign)
    if params["user"]["age"]
      @user.age = params["user"]["age"]
      @user.save!
---
INSERT INTO "users" ("age", "attorney", "campaign", "consent", "created_at", "current_sign_in_at", "current_sign_in_ip", "debt", "desc", "email", "employment", "encrypted_password", "ip", "last_sign_in_at", "last_sign_in_ip", "lead", "loan", "medical", "name", "phone", "previous", "qualified", "remember_created_at", "reset_password_sent_at", "reset_password_token", "sign_in_count", "trusted", "updated_at", "veteran", "zipcode") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29, $30) RETURNING "id"
UPDATE "users" SET "last_sign_in_at" = '2013-04-27 23:32:16.367638', "current_sign_in_at" = '2013-04-27 23:32:16.367638', "last_sign_in_ip" = '127.0.0.1', "current_sign_in_ip" = '127.0.0.1', "sign_in_count" = 1, "updated_at" = '2013-04-27 23:32:16.369300' WHERE "users"."id" = 108